Dr-RegEx/contest2026_497_nitelabu/board/ESP32-S31 Function-CoreBoard-1 + ESP32-S31 Korvo-1/demo/rgb565-display/src/esp-hal-3rdparty/components/upper_hal_cam/dvp/src/esp_cam_ctlr_dvp_cam.c
/*
 * SPDX-FileCopyrightText: 2024-2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <sys/lock.h>
#include <sys/param.h>
#include "esp_memory_utils.h"
#include "hal/cam_ll.h"
#include "hal/color_hal.h"
#include "driver/gpio.h"
#include "esp_cache.h"
#include "esp_macros.h"
#include "esp_private/periph_ctrl.h"
#include "esp_private/esp_cache_private.h"
#include "esp_private/gpio.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_clk_tree.h"
#include "hal/cam_periph.h"
#include "soc/soc_caps.h"
#include "esp_cam_ctlr_dvp_cam.h"
#include "esp_private/esp_cam_dvp.h"
#include "esp_private/esp_clk_tree_common.h"
#include "../../dvp_share_ctrl.h"

#ifdef CONFIG_CAM_CTLR_DVP_CAM_ISR_CACHE_SAFE
#define DVP_CAM_CTLR_ALLOC_CAPS             (MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT)
#else
#define DVP_CAM_CTLR_ALLOC_CAPS             (MALLOC_CAP_DEFAULT)
#endif

#if CONFIG_SPIRAM
#define DVP_CAM_BK_BUFFER_ALLOC_CAPS        (MALLOC_CAP_SPIRAM | MALLOC_CAP_DMA)
#else
#define DVP_CAM_BK_BUFFER_ALLOC_CAPS        (MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA)
#endif

#if CAM_LL_DATA_WIDTH_MAX
#define CAP_DVP_PERIPH_NUM      CAM_LL_PERIPH_NUM           /*!< DVP port number */
#define CAM_DVP_DATA_SIG_NUM    CAM_LL_DATA_WIDTH_MAX       /*!< DVP data bus width of CAM */
#else
#define CAP_DVP_PERIPH_NUM      0                           /*!< Default value */
#define CAM_DVP_DATA_SIG_NUM    0                           /*!< Default value */
#endif

#define DVP_CAM_CONFIG_INPUT_PIN(pin, sig, inv)                     \
{                                                                   \
    if (pin != GPIO_NUM_NC) {                                       \
        ret = esp_cam_ctlr_dvp_config_input_gpio(pin, sig, inv);    \
        if (ret != ESP_OK) {                                        \
            ESP_LOGE(TAG, "failed to configure pin=%d sig=%d",      \
                    pin, sig);                                      \
            return ret;                                             \
        }                                                           \
    }                                                               \
}

typedef struct dvp_platform {
    _lock_t         mutex;
    esp_cam_ctlr_dvp_cam_t *ctlrs[CAP_DVP_PERIPH_NUM];
} dvp_platform_t;

static dvp_platform_t s_platform;
static const char *TAG = "dvp_cam";
static soc_module_clk_t s_dvp_clk_src[CAP_DVP_PERIPH_NUM];

/**
 * @brief Claim DVP controller
 *
 * @param ctlr_id DVP controller ID
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
static esp_err_t s_dvp_claim_ctlr(int ctlr_id, esp_cam_ctlr_dvp_cam_t *ctlr)
{
    esp_err_t ret = ESP_ERR_NOT_FOUND;

    _lock_acquire(&s_platform.mutex);
    if (!s_platform.ctlrs[ctlr_id]) {
        s_platform.ctlrs[ctlr_id] = ctlr;
        ret = ESP_OK;
    }
    _lock_release(&s_platform.mutex);

    return ret;
}

/**
 * @brief Declaim DVP controller
 *
 * @param ctlr_id DVP controller ID
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
static esp_err_t s_dvp_declaim_ctlr(int ctlr_id)
{
    esp_err_t ret = ESP_ERR_NOT_FOUND;

    _lock_acquire(&s_platform.mutex);
    if (s_platform.ctlrs[ctlr_id]) {
        s_platform.ctlrs[ctlr_id] = NULL;
        ret = ESP_OK;
    }
    _lock_release(&s_platform.mutex);

    return ret;
}

/**
 * @brief CAM DVP initialzie input GPIO pin.
 *
 * @param pin    DVP pin number
 * @param signal DVP pin mapping signal
 * @param inv    true: DVP pin is inverted, false: DVP pin is not inverted
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
static esp_err_t esp_cam_ctlr_dvp_config_input_gpio(int pin, int signal, bool inv)
{
    esp_err_t ret;

    gpio_func_sel(pin, PIN_FUNC_GPIO);
    ret = gpio_set_direction(pin, GPIO_MODE_INPUT);
    if (ret != ESP_OK) {
        return ret;
    }
    ret = gpio_set_pull_mode(pin, GPIO_FLOATING);
    if (ret != ESP_OK) {
        return ret;
    }
    esp_rom_gpio_connect_in_signal(pin, signal, inv);

    return ESP_OK;
}

/**
 * @brief CAM DVP start receiving frame.
 *
 * @param ctlr CAM DVP controller
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
static IRAM_ATTR esp_err_t esp_cam_ctlr_dvp_start_trans(esp_cam_ctlr_dvp_cam_t *ctlr)
{
    bool buffer_ready = false;
    esp_cam_ctlr_trans_t trans = {0};

    if (ctlr->cur_buf) {
        ctlr->cur_buf = NULL;
        ESP_RETURN_ON_ERROR_ISR(esp_cam_ctlr_dvp_dma_stop(&ctlr->dma), TAG, "failed to stop DMA");
    }

    if (ctlr->cbs.on_get_new_trans) {
        ctlr->cbs.on_get_new_trans(&(ctlr->base), &trans, ctlr->cbs_user_data);
        if (trans.buffer) {
            buffer_ready = true;
        }
    }

    if (!buffer_ready && !ctlr->bk_buffer_dis) {
        trans.buffer = ctlr->backup_buffer;
        trans.buflen = ctlr->fb_size_in_bytes;
        buffer_ready = true;
    }

    if (!buffer_ready) {
        assert(false && "no new buffer, and no driver internal buffer");
    }

    ESP_RETURN_ON_ERROR(esp_cache_msync((void *)(trans.buffer), trans.buflen, ESP_CACHE_MSYNC_FLAG_DIR_M2C),
                        TAG, "failed to sync(M2C) trans buffer");

    ESP_RETURN_ON_ERROR_ISR(esp_cam_ctlr_dvp_dma_reset(&ctlr->dma), TAG, "failed to reset DMA");
    /* Publish ownership before enabling DMA: the first EOF can preempt
     * the initial task-side start and immediately arm the next buffer. */
    ctlr->cur_buf = trans.buffer;
    esp_err_t ret = esp_cam_ctlr_dvp_dma_start(&ctlr->dma, trans.buffer, ctlr->fb_size_in_bytes);
    if (ret != ESP_OK) {
        ctlr->cur_buf = NULL;
        return ret;
    }

    return ESP_OK;
}

/**
 * @brief Check JPEG file and return JPEG frame actual size
 *
 * @param buffer JPEG buffer pointer
 * @param size   JPEG buffer size
 *
 * @return JPEG frame actual size if success or 0 if not JPEG header or tail TAG is found
 */
static uint32_t IRAM_ATTR esp_cam_ctlr_dvp_get_jpeg_size(const uint8_t *buffer, uint32_t size)
{
    /* Check JPEG header TAG: ff:d8 */

