Dr-RegEx/contest2026_497_nitelabu/board/ESP32-S31 Function-CoreBoard-1 + ESP32-S31 Korvo-1/demo/rgb565-display/src/esp-hal-3rdparty/components/upper_hal_cam/dvp/src/esp_cam_ctlr_dvp_cam.c
    if (buffer[0] != 0xff || buffer[1] != 0xd8) {
        return 0;
    }

    for (uint32_t off = size - 2; off > 2; off--) {
        /* Check JPEG tail TAG: ff:d9 */

        if (buffer[off] == 0xff && buffer[off + 1] == 0xd9) {
            return off + 2;
        }
    }

    return 0;
}

/**
 * @brief CAM DVP get actually received data size in byte
 *
 * @param ctlr                 CAM DVP controller
 * @param rx_buffer            CAM DVP receive buffer
 * @param dma_recv_size        CAM DVP DMA receive buffer size
 *
 * @return Received data size if success or 0 if failed
 */
static uint32_t IRAM_ATTR esp_cam_ctlr_dvp_get_recved_size(esp_cam_ctlr_dvp_cam_t *ctlr, uint8_t *rx_buffer, uint32_t dma_recv_size)
{
    uint32_t recv_buffer_size;

    if (ctlr->pic_format_jpeg) {
        recv_buffer_size = ESP_ALIGN_UP(MIN(dma_recv_size, ctlr->fb_size_in_bytes), 64);
    } else {
        recv_buffer_size = ctlr->fb_size_in_bytes;
    }

    if (esp_ptr_external_ram(rx_buffer)) {
        esp_err_t ret = esp_cache_msync(rx_buffer, recv_buffer_size, ESP_CACHE_MSYNC_FLAG_DIR_M2C);
        assert(ret == ESP_OK);
        (void)ret;

    }

    if (ctlr->pic_format_jpeg) {
        recv_buffer_size = esp_cam_ctlr_dvp_get_jpeg_size(rx_buffer, dma_recv_size);
    }

    return recv_buffer_size;
}

/**
 * @brief CAM DVP calculate frame receive buffer size.
 *
 * @param config  CAM DVP controller configurations
 * @param p_size  CAM DVP frame receive buffer size buffer pointer
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
static esp_err_t esp_cam_ctlr_dvp_cam_get_frame_size(const esp_cam_ctlr_dvp_config_t *config, size_t *p_size)
{
    esp_err_t ret = ESP_OK;

    if (config->pic_format_jpeg) {
        *p_size = config->h_res * config->v_res;
    } else {
        uint32_t depth = color_hal_pixel_format_fourcc_get_bit_depth(config->input_data_color_type);
        if (!depth) {
            return ESP_ERR_INVALID_ARG;
        }

        *p_size = config->h_res * config->v_res * depth / 8;
    }

    return ret;
}

/**
 * @brief CAM DVP receive frame done interrupt callback function.
 *
 * @param dma_chan   DMA channel
 * @param event_data DMA event data
 * @param user_data  DMA interrupt callback user data
 *
 * @return
 *      - true: trigger task switch
 *      - false: don't trigger task switch
 */
static IRAM_ATTR bool esp_cam_ctlr_recv_frame_done_isr(gdma_channel_handle_t dma_chan, gdma_event_data_t *event_data, void *user_data)
{
    bool need_switch = false;
    esp_cam_ctlr_dvp_cam_t *ctlr = (esp_cam_ctlr_dvp_cam_t *)user_data;
    size_t dma_recv_size = esp_cam_ctlr_dvp_dma_get_recv_size(&ctlr->dma);
    esp_cam_ctlr_trans_t trans = {
        .buffer = ctlr->cur_buf,
    };

    esp_cam_ctlr_dvp_start_trans(ctlr);

    if ((trans.buffer != ctlr->backup_buffer) || ctlr->bk_buffer_exposed) {
        trans.buflen = ctlr->fb_size_in_bytes;
        trans.received_size = esp_cam_ctlr_dvp_get_recved_size(ctlr, trans.buffer, dma_recv_size);
        need_switch = ctlr->cbs.on_trans_finished(&ctlr->base, &trans, ctlr->cbs_user_data);
    }

    return need_switch;
}

/**
 * @brief ESP CAM DVP initialzie clock and GPIO.
 *
 * @param ctlr_id CAM DVP controller ID
 * @param clk_src CAM DVP clock source
 * @param pin     CAM DVP pin configuration
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
esp_err_t esp_cam_ctlr_dvp_init(int ctlr_id, cam_clock_source_t clk_src, const esp_cam_ctlr_dvp_pin_config_t *pin)
{
    esp_err_t ret;

    ESP_RETURN_ON_FALSE(ctlr_id < CAP_DVP_PERIPH_NUM, ESP_ERR_INVALID_ARG, TAG, "invalid argument: ctlr_id >= %d", CAP_DVP_PERIPH_NUM);
    ESP_RETURN_ON_FALSE(pin->data_width == CAM_CTLR_DATA_WIDTH_8, ESP_ERR_INVALID_ARG, TAG, "invalid argument: data_width != CAM_CTLR_DATA_WIDTH_8");
    ESP_RETURN_ON_FALSE(pin, ESP_ERR_INVALID_ARG, TAG, "invalid argument: pin is null");

    DVP_CAM_CONFIG_INPUT_PIN(pin->vsync_io, cam_periph_signals.buses[ctlr_id].vsync_sig, true);
    DVP_CAM_CONFIG_INPUT_PIN(pin->de_io,  cam_periph_signals.buses[ctlr_id].de_sig,  false);
    DVP_CAM_CONFIG_INPUT_PIN(pin->pclk_io,  cam_periph_signals.buses[ctlr_id].pclk_sig,  false);
    for (int i = 0; i < pin->data_width; i++) {
        DVP_CAM_CONFIG_INPUT_PIN(pin->data_io[i], cam_periph_signals.buses[ctlr_id].data_sigs[i], false);
    }

    /* If using external XTAL, don't initialize xclock pin */

    if (pin->xclk_io != GPIO_NUM_NC) {
        gpio_func_sel(pin->xclk_io, PIN_FUNC_GPIO);
        ret = gpio_set_direction(pin->xclk_io, GPIO_MODE_OUTPUT);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "failed to configure pin=%d", pin->xclk_io);
            return ret;
        }
        esp_rom_gpio_connect_out_signal(pin->xclk_io, cam_periph_signals.buses[ctlr_id].clk_sig, false, false);
    }

#if CONFIG_IDF_TARGET_ESP32S31
    ESP_ERROR_CHECK(esp_clk_tree_enable_src((soc_module_clk_t)CAM_CORE_CLK_SRC_DEFAULT, true));
#endif

    PERIPH_RCC_ACQUIRE_ATOMIC(cam_periph_signals.buses[ctlr_id].module, ref_count) {
        if (ref_count == 0) {
            cam_ll_enable_bus_clock(ctlr_id, true);
            cam_ll_reset_register(ctlr_id);
#if CONFIG_IDF_TARGET_ESP32S31
            cam_ll_select_core_clk_src(ctlr_id, CAM_CORE_CLK_SRC_DEFAULT);
            cam_ll_set_core_clock_divider(ctlr_id, 2, 0, 0);
#endif
        }
    }

    ESP_ERROR_CHECK(esp_clk_tree_enable_src((soc_module_clk_t)clk_src, true));
    s_dvp_clk_src[ctlr_id] = (soc_module_clk_t)clk_src;
    PERIPH_RCC_ATOMIC() {
        cam_ll_enable_clk(ctlr_id, true);
        cam_ll_select_clk_src(ctlr_id, clk_src);
    };

    return ESP_OK;
}

/**
 * @brief ESP CAM DVP output hardware clock, the function "esp_cam_ctlr_dvp_init" should be called first
 *
 * @param ctlr_id   CAM DVP controller ID
 * @param clk_src   CAM DVP clock source
 * @param xclk_freq CAM DVP output clock frequency in HZ
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
esp_err_t esp_cam_ctlr_dvp_output_clock(int ctlr_id, cam_clock_source_t clk_src, uint32_t xclk_freq)
{
    esp_err_t ret = ESP_ERR_INVALID_ARG;
    uint32_t src_clk_hz;

    ESP_RETURN_ON_FALSE(ctlr_id < CAP_DVP_PERIPH_NUM, ESP_ERR_INVALID_ARG, TAG, "invalid argument: ctlr_id >= %d", CAP_DVP_PERIPH_NUM);
    ESP_RETURN_ON_ERROR(esp_clk_tree_src_get_freq_hz((soc_module_clk_t)clk_src, ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED, &src_clk_hz),
                        TAG, "failed to get clock source frequency");

    ESP_LOGD(TAG, "DVP clock source frequency %" PRIu32 "Hz", src_clk_hz);

    if ((src_clk_hz % xclk_freq) == 0) {
        PERIPH_RCC_ATOMIC() {
            // The camera sensors require precision without frequency and duty cycle jitter,
            // so the fractional divisor can't be used.
            cam_ll_set_group_clock_coeff(ctlr_id, src_clk_hz / xclk_freq, 0, 0);
        };

