Dr-RegEx/contest2026_497_nitelabu/board/ESP32-S31 Function-CoreBoard-1 + ESP32-S31 Korvo-1/demo/rgb565-display/src/esp-hal-3rdparty/components/upper_hal_cam/dvp/src/esp_cam_ctlr_dvp_cam.c
        ret = ESP_OK;
    } else {
        ESP_LOGE(TAG, "calculated frequency divider is not integer so clock isn't changed");
    }

    return ret;
}

/**
 * @brief Initialize ESP CAM DVP clock pin (other DVP GPIO pins excluded the clock pins will not be initialized)
 *        and hardware clock, then output clock signal with given frequency
 *
 * @note The function is implemented based on "esp_cam_ctlr_dvp_init" and "esp_cam_ctlr_dvp_output_clock",
 *       so calling "esp_cam_ctlr_dvp_init" and "esp_cam_ctlr_dvp_output_clock" is not required
 *
 * @param ctlr_id DVP controller ID
 * @param pin     DVP clock pin
 * @param clk_src DVP clock source
 * @param xclk_freq DVP clock frequency
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
esp_err_t esp_cam_ctlr_dvp_start_clock(int ctlr_id, gpio_num_t pin, cam_clock_source_t clk_src, uint32_t xclk_freq)
{
    esp_cam_ctlr_dvp_pin_config_t pin_config = {0};

    pin_config.data_width = CAM_CTLR_DATA_WIDTH_8;
    pin_config.vsync_io = GPIO_NUM_NC;
    pin_config.de_io = GPIO_NUM_NC;
    pin_config.pclk_io = GPIO_NUM_NC;
    for (int i = 0; i < CAM_DVP_DATA_SIG_NUM; i++) {
        pin_config.data_io[i] = GPIO_NUM_NC;
    }
    pin_config.xclk_io = pin;

    ESP_RETURN_ON_ERROR(esp_cam_ctlr_dvp_init(ctlr_id, clk_src, &pin_config), TAG, "failed to initialize DVP controller");
    ESP_RETURN_ON_ERROR(esp_cam_ctlr_dvp_output_clock(ctlr_id, clk_src, xclk_freq), TAG, "failed to output clock");

    return ESP_OK;
}

/**
 * @brief ESP CAM DVP de-initialzie.
 *
 * @param ctlr_id DVP controller ID
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
esp_err_t esp_cam_ctlr_dvp_deinit(int ctlr_id)
{
    ESP_RETURN_ON_FALSE(ctlr_id < CAP_DVP_PERIPH_NUM, ESP_ERR_INVALID_ARG, TAG, "invalid argument: ctlr_id >= %d", CAP_DVP_PERIPH_NUM);

    PERIPH_RCC_ATOMIC() {
        cam_ll_enable_clk(ctlr_id, false);
    };

    PERIPH_RCC_RELEASE_ATOMIC(cam_periph_signals.buses[ctlr_id].module, ref_count) {
        if (ref_count == 0) {
            cam_ll_reset_register(ctlr_id);
            cam_ll_enable_bus_clock(ctlr_id, false);
        }
    }

    if (s_dvp_clk_src[ctlr_id]) {
        esp_clk_tree_enable_src(s_dvp_clk_src[ctlr_id], false);
        s_dvp_clk_src[ctlr_id] = 0;
    }

#if CONFIG_IDF_TARGET_ESP32S31
    esp_clk_tree_enable_src((soc_module_clk_t)CAM_CORE_CLK_SRC_DEFAULT, false);
#endif

    return ESP_OK;
}

/**
 * @brief Enable CAM DVP camera controller
 *
 * @param handle ESP CAM controller handle
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
static esp_err_t esp_cam_ctlr_dvp_cam_enable(esp_cam_ctlr_handle_t handle)
{
    esp_err_t ret = ESP_ERR_INVALID_STATE;
    esp_cam_ctlr_dvp_cam_t *ctlr = (esp_cam_ctlr_dvp_cam_t *)handle;

    ESP_RETURN_ON_FALSE(ctlr, ESP_ERR_INVALID_ARG, TAG, "invalid argument: handle is null");

    portENTER_CRITICAL(&ctlr->spinlock);
    if (ctlr->dvp_fsm == ESP_CAM_CTLR_DVP_CAM_FSM_INIT) {
        ctlr->dvp_fsm = ESP_CAM_CTLR_DVP_CAM_FSM_ENABLED;
        ret = ESP_OK;
    }
    cam_hal_start_streaming(&ctlr->hal);
#if CONFIG_PM_ENABLE
    if (ctlr->pm_lock) {
        ESP_RETURN_ON_ERROR(esp_pm_lock_acquire(ctlr->pm_lock), TAG, "acquire pm_lock failed");
    }
#endif // CONFIG_PM_ENABLE

    portEXIT_CRITICAL(&ctlr->spinlock);

    return ret;
}

/**
 * @brief Disable CAM DVP camera controller
 *
 * @param handle ESP CAM controller handle
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
static esp_err_t esp_cam_ctlr_dvp_cam_disable(esp_cam_ctlr_handle_t handle)
{
    esp_err_t ret = ESP_ERR_INVALID_STATE;
    esp_cam_ctlr_dvp_cam_t *ctlr = (esp_cam_ctlr_dvp_cam_t *)handle;

    ESP_RETURN_ON_FALSE(ctlr, ESP_ERR_INVALID_ARG, TAG, "invalid argument: handle is null");

    portENTER_CRITICAL(&ctlr->spinlock);
    if (ctlr->dvp_fsm == ESP_CAM_CTLR_DVP_CAM_FSM_ENABLED) {
        ctlr->dvp_fsm = ESP_CAM_CTLR_DVP_CAM_FSM_INIT;
        ret = ESP_OK;
    }
    cam_hal_stop_streaming(&ctlr->hal);

#if CONFIG_PM_ENABLE
    if (ctlr->pm_lock) {
        ESP_RETURN_ON_ERROR(esp_pm_lock_release(ctlr->pm_lock), TAG, "release pm_lock failed");
    }
#endif // CONFIG_PM_ENABLE
    portEXIT_CRITICAL(&ctlr->spinlock);

    return ret;
}

/**
 * @brief Start CAM DVP camera controller
 *
 * @param handle ESP CAM controller handle
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
static esp_err_t esp_cam_ctlr_dvp_cam_start(esp_cam_ctlr_handle_t handle)
{
    bool start = false;
    esp_err_t ret = ESP_ERR_INVALID_STATE;
    esp_cam_ctlr_dvp_cam_t *ctlr = (esp_cam_ctlr_dvp_cam_t *)handle;

    ESP_RETURN_ON_FALSE(ctlr, ESP_ERR_INVALID_ARG, TAG, "invalid argument: handle is null");

    portENTER_CRITICAL(&ctlr->spinlock);
    if (ctlr->dvp_fsm == ESP_CAM_CTLR_DVP_CAM_FSM_ENABLED) {
        ctlr->cur_buf = NULL;
        ctlr->dvp_fsm = ESP_CAM_CTLR_DVP_CAM_FSM_STARTED;
        start = true;
    }
    portEXIT_CRITICAL(&ctlr->spinlock);

    if (start) {
        /* stop() disables the receiver while leaving the controller enabled.
         * Restore receiver/FIFO before starting its DMA handshake. */
        cam_hal_start_streaming(&ctlr->hal);
        ret = esp_cam_ctlr_dvp_start_trans(ctlr);
        if (ret != ESP_OK) {
            cam_hal_stop_streaming(&ctlr->hal);
            portENTER_CRITICAL(&ctlr->spinlock);
            ctlr->dvp_fsm = ESP_CAM_CTLR_DVP_CAM_FSM_ENABLED;
            portEXIT_CRITICAL(&ctlr->spinlock);
        }
    }

    return ret;
}

/**
 * @brief Stop CAM DVP camera controller
 *
 * @param handle ESP CAM controller handle
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
static esp_err_t esp_cam_ctlr_dvp_cam_stop(esp_cam_ctlr_handle_t handle)
{
    esp_err_t ret = ESP_ERR_INVALID_STATE;
    esp_cam_ctlr_dvp_cam_t *ctlr = (esp_cam_ctlr_dvp_cam_t *)handle;

    ESP_RETURN_ON_FALSE(ctlr, ESP_ERR_INVALID_ARG, TAG, "invalid argument: handle is null");

    portENTER_CRITICAL(&ctlr->spinlock);
    if (ctlr->dvp_fsm == ESP_CAM_CTLR_DVP_CAM_FSM_STARTED) {
        cam_hal_stop_streaming(&ctlr->hal);
        esp_cam_ctlr_dvp_dma_stop(&ctlr->dma);
        ctlr->dvp_fsm = ESP_CAM_CTLR_DVP_CAM_FSM_ENABLED;
        ret = ESP_OK;
    }
    portEXIT_CRITICAL(&ctlr->spinlock);

    return ret;
}

/**
 * @brief Delete CAM DVP camera controller
 *
 * @param handle ESP CAM controller handle
 *
 * @return
 *      - ESP_OK on success
 *      - Others if failed
 */
static esp_err_t esp_cam_ctlr_dvp_cam_del(esp_cam_ctlr_handle_t handle)
{
    esp_err_t ret = ESP_ERR_INVALID_STATE;
    esp_cam_ctlr_dvp_cam_t *ctlr = (esp_cam_ctlr_dvp_cam_t *)handle;

    ESP_RETURN_ON_FALSE(ctlr, ESP_ERR_INVALID_ARG, TAG, "invalid argument: handle is null");

