Dr-RegEx/contest2026_497_nitelabu/board/ESP32-S31 Function-CoreBoard-1 + ESP32-S31 Korvo-1/demo/rgb565-display/src/esp-hal-3rdparty/components/upper_hal_cam/dvp/src/esp_cam_ctlr_dvp_cam.c
    ESP_RETURN_ON_ERROR(esp_cache_get_alignment(DVP_CAM_BK_BUFFER_ALLOC_CAPS, &alignment_size), TAG, "failed to get cache alignment");
    ESP_RETURN_ON_ERROR(esp_cam_ctlr_dvp_cam_get_frame_size(config, &fb_size_in_bytes), TAG, "invalid argument: input frame pixel format is not supported");
    ESP_RETURN_ON_ERROR(dvp_shared_ctrl_claim_io_signals(), TAG, "failed to claim io signals");

    esp_cam_ctlr_dvp_cam_t *ctlr = heap_caps_calloc(1, sizeof(esp_cam_ctlr_dvp_cam_t), DVP_CAM_CTLR_ALLOC_CAPS);
    ESP_GOTO_ON_FALSE(ctlr, ESP_ERR_NO_MEM, fail0, TAG, "no mem for CAM DVP controller context");

    ESP_GOTO_ON_ERROR(s_dvp_claim_ctlr(config->ctlr_id, ctlr), fail1, TAG, "no available DVP controller");

    ESP_LOGD(TAG, "alignment: 0x%x\n", alignment_size);
    if (alignment_size) {
        fb_size_in_bytes = ESP_ALIGN_UP(fb_size_in_bytes, alignment_size);
    }
    if (!config->bk_buffer_dis) {
        ctlr->backup_buffer = heap_caps_aligned_alloc(alignment_size, fb_size_in_bytes, DVP_CAM_BK_BUFFER_ALLOC_CAPS);
        ESP_GOTO_ON_FALSE(ctlr->backup_buffer, ESP_ERR_NO_MEM, fail2, TAG, "no mem for DVP backup buffer");
    }

    ESP_GOTO_ON_ERROR(esp_cam_ctlr_dvp_dma_init(&ctlr->dma, config->dma_burst_size, fb_size_in_bytes),
                      fail3, TAG, "failed to initialize DVP DMA");

    gdma_rx_event_callbacks_t cbs = {
        .on_recv_eof = esp_cam_ctlr_recv_frame_done_isr
    };

    ESP_GOTO_ON_ERROR(gdma_register_rx_event_callbacks(ctlr->dma.dma_chan, &cbs, ctlr),
                      fail4, TAG, "failed to register DMA event callbacks");

#if CONFIG_PM_ENABLE
    ESP_GOTO_ON_ERROR(esp_pm_lock_create(ESP_PM_APB_FREQ_MAX, 0, "dvp_cam_ctlr", &ctlr->pm_lock), fail5, TAG, "failed to create pm lock");
#endif //CONFIG_PM_ENABLE

    /* Initialize DVP controller */

    cam_hal_config_t cam_hal_config = {
        .port = config->ctlr_id,
        .cam_data_width = config->cam_data_width == 0 ? 8 : config->cam_data_width,
        .bit_swap_en = config->bit_swap_en,
        .byte_swap_en = config->byte_swap_en,
    };

    ESP_RETURN_ON_FALSE(cam_hal_config.cam_data_width == 8 || cam_hal_config.cam_data_width == 16 || cam_hal_config.cam_data_width == 24, ESP_ERR_INVALID_ARG, TAG, "invalid argument: cam_data_width is not 8 or 16 or 24");

#if !CONFIG_ESP32P4_SELECTS_REV_LESS_V3
    ESP_RETURN_ON_FALSE(cam_hal_config.cam_data_width != 8 || cam_hal_config.byte_swap_en == 0, ESP_ERR_INVALID_ARG, TAG, "invalid argument: byte swap is not supported when cam_data_width is 8");
#endif

    if (!config->pin_dont_init) {
        // Initialzie DVP clock and GPIO internally
        ESP_GOTO_ON_ERROR(esp_cam_ctlr_dvp_init(config->ctlr_id, config->clk_src, config->pin),
                          fail5, TAG, "failed to initialize clock and GPIO");
    }

    if (!config->external_xtal) {
        // Generate DVP xtal clock internally
        ESP_GOTO_ON_ERROR(esp_cam_ctlr_dvp_output_clock(config->ctlr_id, config->clk_src, config->xclk_freq),
                          fail5, TAG, "failed to generate xtal clock");
    }

    cam_hal_init(&ctlr->hal, &cam_hal_config);

    cam_ctlr_format_conv_config_t format_conv_config = {
        .src_format = config->input_data_color_type,
        .dst_format = config->output_data_color_type,
        .conv_std = config->conv_std,
        .data_width = config->cam_data_width == 0 ? 8 : config->cam_data_width,
        .input_range = config->input_range,
        .output_range = config->output_range,
    };
    ESP_GOTO_ON_ERROR(esp_cam_ctlr_dvp_format_conversion(&(ctlr->base), &format_conv_config), fail5, TAG, "failed to configure format conversion");

    ctlr->ctlr_id = config->ctlr_id;
    ctlr->fb_size_in_bytes = fb_size_in_bytes;
    ctlr->dvp_fsm = ESP_CAM_CTLR_DVP_CAM_FSM_INIT;
    ctlr->input_data_color_type = config->input_data_color_type;
    ctlr->pic_format_jpeg = config->pic_format_jpeg;
    ctlr->bk_buffer_dis = config->bk_buffer_dis;
    ctlr->pin_dont_init = config->pin_dont_init;
    ctlr->spinlock = (portMUX_TYPE)portMUX_INITIALIZER_UNLOCKED;

    ctlr->base.del = esp_cam_ctlr_dvp_cam_del;
    ctlr->base.enable = esp_cam_ctlr_dvp_cam_enable;
    ctlr->base.start = esp_cam_ctlr_dvp_cam_start;
    ctlr->base.stop = esp_cam_ctlr_dvp_cam_stop;
    ctlr->base.disable = esp_cam_ctlr_dvp_cam_disable;
    ctlr->base.register_event_callbacks = esp_cam_ctlr_dvp_cam_register_event_callbacks;
    ctlr->base.get_internal_buffer = esp_cam_ctlr_dvp_cam_get_internal_buffer;
    ctlr->base.get_buffer_len = esp_cam_ctlr_get_dvp_cam_frame_buffer_len;
    ctlr->base.alloc_buffer = esp_cam_ctlr_dvp_cam_alloc_buffer;
    ctlr->base.format_conversion = esp_cam_ctlr_dvp_format_conversion;

    *ret_handle = &ctlr->base;

    return ESP_OK;

fail5:
    cam_hal_deinit(&ctlr->hal);
fail4:
    esp_cam_ctlr_dvp_dma_deinit(&ctlr->dma);
fail3:
    if (!config->bk_buffer_dis) {
        heap_caps_free(ctlr->backup_buffer);
    }
fail2:
    s_dvp_declaim_ctlr(config->ctlr_id);
fail1:
    heap_caps_free(ctlr);
fail0:
    dvp_shared_ctrl_declaim_io_signals();
    return ret;
}
